In [2]:
# Creation of the table
1. From sql alchemy

SyntaxError: invalid syntax (<ipython-input-2-f5f860563d24>, line 2)

In [3]:
import pandas as pd

In [4]:
from sqlalchemy import create_engine

In [5]:
sqlitedb_path = '/Users/luisdemiguel/Desktop/Ironhack/data-project-template/data/raw_data_project_m1.db'

In [6]:
engine = create_engine(f'sqlite:///{sqlitedb_path}')

In [7]:
# list all tables in database
raw_data = pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table'", engine)

In [8]:
raw_data

            name
0  personal_info
1   country_info
2    career_info
3      poll_info

In [14]:
country_info = pd.read_sql_query("select * from country_info", engine)
country_info.head()

                                   uuid country_code        rural
0  f6e7ee00-deac-0133-4de8-0a81e8b09a82           AT  countryside
1  54f0f1c0-dda1-0133-a559-0a81e8b09a82           AT        urban
2  83127080-da3d-0133-c74f-0a81e8b09a82           AT         city
3  15626d40-db13-0133-ea5c-0a81e8b09a82           AT      Country
4  24954a70-db98-0133-4a64-0a81e8b09a82           AT         city

In [15]:
career_info = pd.read_sql_query("select * from career_info", engine)
career_info.head()

,uuid,dem_education_level,dem_full_time_job,normalized_job_code
0,f6e7ee00-deac-0133-4de8-0a81e8b09a82,no,no,None
1,54f0f1c0-dda1-0133-a559-0a81e8b09a82,high,yes,861a9b9151e11362eb3c77ca914172d0
2,83127080-da3d-0133-c74f-0a81e8b09a82,None,no,None
3,15626d40-db13-0133-ea5c-0a81e8b09a82,high,yes,049a3f3a2b5f85cb2971ba77ad66e10c
4,24954a70-db98-0133-4a64-0a81e8b09a82,high,yes,f4b2fb1aa40f661488e2782b6d57ad2f

In [85]:
personal_info = pd.read_sql_query("select * from personal_info", engine)
personal_info.head()

,uuid,age,gender,dem_has_children,age_group
0,f6e7ee00-deac-0133-4de8-0a81e8b09a82,61 years old,male,NO,40_65
1,54f0f1c0-dda1-0133-a559-0a81e8b09a82,57 years old,male,yES,40_65
2,83127080-da3d-0133-c74f-0a81e8b09a82,32 years old,male,nO,26_39
3,15626d40-db13-0133-ea5c-0a81e8b09a82,45 years old,Male,YES,40_65
4,24954a70-db98-0133-4a64-0a81e8b09a82,41 years old,Fem,yES,40_65

In [160]:
between_info = pd.merge(country_info, career_info,
                           how='inner', on='uuid')

merge_info = pd.merge(between_info, personal_info,
                           how='inner', on='uuid')

filtered_info = merge_info[["uuid", "country_code", "normalized_job_code", "gender"]]

In [161]:
filtered_info.head()

,uuid,country_code,normalized_job_code,gender
0,f6e7ee00-deac-0133-4de8-0a81e8b09a82,AT,None,male
1,54f0f1c0-dda1-0133-a559-0a81e8b09a82,AT,861a9b9151e11362eb3c77ca914172d0,male
2,83127080-da3d-0133-c74f-0a81e8b09a82,AT,None,male
3,15626d40-db13-0133-ea5c-0a81e8b09a82,AT,049a3f3a2b5f85cb2971ba77ad66e10c,Male
4,24954a70-db98-0133-4a64-0a81e8b09a82,AT,f4b2fb1aa40f661488e2782b6d57ad2f,Fem

In [162]:
rename_database = filtered_info.rename(columns={"normalized_job_code": "job"})
rename_database

,uuid,country_code,job,gender
0,f6e7ee00-deac-0133-4de8-0a81e8b09a82,AT,None,male
1,54f0f1c0-dda1-0133-a559-0a81e8b09a82,AT,861a9b9151e11362eb3c77ca914172d0,male
2,83127080-da3d-0133-c74f-0a81e8b09a82,AT,None,male
3,15626d40-db13-0133-ea5c-0a81e8b09a82,AT,049a3f3a2b5f85cb2971ba77ad66e10c,Male
4,24954a70-db98-0133-4a64-0a81e8b09a82,AT,f4b2fb1aa40f661488e2782b6d57ad2f,Fem
...,...,...,...,...
9644,7d1ac020-dcb4-0133-817a-0a81e8b09a82,SK,847165cfda6b1dc82ae22b967da8af2f,FeMale
9645,39f989f0-db52-0133-8482-0a81e8b09a82,SK,a4d5b8b38f9513825d0d94a981ebe962,Male
9646,70ce4a90-d965-0133-f5e4-0a81e8b09a82,SK,None,male
9647,2896e440-db3c-0133-5b67-0a81e8b09a82,SK,775190277a849cba701b306a7b374c0a,male
9648,06217ba0-dd56-0133-edda-0a81e8b09a82,SK,8a7a3f1bce0958ae9f090683e5a925b7,FeMale

In [163]:
#now we start with the part of apis

In [164]:

import requests

response = requests.get('http://api.dataatwork.org/v1/jobs/autocomplete?contains=data')

json_data = response.json()

In [165]:
data_api = pd.DataFrame(json_data)
data_api.head()

,uuid,suggestion,normalized_job_title,parent_uuid
0,8fd068c8d9be73abfa678856177b6c40,Data Operations Director,data operations director,bb4e5066e69e4228172b4850d2a920f4
1,ac47656fd51c2cd8037057262c910dc4,Data Processing Manager,data processing manager,bb4e5066e69e4228172b4850d2a920f4
2,800b621aab5dac18f4caef621fa43a49,Data Systems Manager,data systems manager,bb4e5066e69e4228172b4850d2a920f4
3,3833bd699e7afe4665b595f282da0387,Database Development and Administration Projec...,database development and administration projec...,bb4e5066e69e4228172b4850d2a920f4
4,e2f68bf748aea2c7d2254550c0c92b23,Director of Data Operations,director of data operations,bb4e5066e69e4228172b4850d2a920f4

In [166]:
rename_api = data_api.rename(columns={"uuid": "job"})
rename_api

,job,suggestion,normalized_job_title,parent_uuid
0,8fd068c8d9be73abfa678856177b6c40,Data Operations Director,data operations director,bb4e5066e69e4228172b4850d2a920f4
1,ac47656fd51c2cd8037057262c910dc4,Data Processing Manager,data processing manager,bb4e5066e69e4228172b4850d2a920f4
2,800b621aab5dac18f4caef621fa43a49,Data Systems Manager,data systems manager,bb4e5066e69e4228172b4850d2a920f4
3,3833bd699e7afe4665b595f282da0387,Database Development and Administration Projec...,database development and administration projec...,bb4e5066e69e4228172b4850d2a920f4
4,e2f68bf748aea2c7d2254550c0c92b23,Director of Data Operations,director of data operations,bb4e5066e69e4228172b4850d2a920f4
...,...,...,...,...
151,00bff17fca67555d8d86e8ead86dcd70,Database Analyst,database analyst,b90ca4df5690002377a7b0f1f3d40781
152,f1fb62e4c97f4f5cd5001877cb94379e,Data Processor,data processor,344aba9dcfa11889b5ae926bfab624e8
153,05bb9a333a66d6eb151e253623efe1c0,Data Entry Clerk,data entry clerk,bf88358c56bb6cbe7eabec38ae333d19
154,bdf4dcd92089bc17345de83f4d06090f,Data Entry Operator,data entry operator,bf88358c56bb6cbe7eabec38ae333d19
155,eb3d789747d52df803ce63fe37bf53e9,Data Analyst,data analyst,325e2251e20170928426473156bd3c48

In [167]:
#merge both data

merge_api = pd.merge(rename_database, rename_api,
                           how='inner', on='job')

data_plus_api = merge_api[["uuid", "country_code", "suggestion", "gender"]]

In [168]:
data_plus_api

,uuid,country_code,suggestion,gender
0,54f0f1c0-dda1-0133-a559-0a81e8b09a82,AT,Automatic Data Processing Planner,male
1,cf24ed60-da3f-0133-0034-0a81e8b09a82,AT,Automatic Data Processing Planner,FeMale
2,9ffc7390-dba5-0133-259b-0a81e8b09a82,BE,Automatic Data Processing Planner,male
3,a6361230-da58-0133-cd5a-0a81e8b09a82,BE,Automatic Data Processing Planner,Male
4,1e2b4750-d987-0133-3c7c-0a81e8b09a82,BG,Automatic Data Processing Planner,female
...,...,...,...,...
5697,1cb1aac0-d94c-0133-8baa-0a81e8b09a82,IT,Data Capture Clerk,male
5698,c8c33390-da69-0133-063a-0a81e8b09a82,PL,Data Capture Clerk,male
5699,d27d24d0-d9b1-0133-03d4-0a81e8b09a82,PL,Data Capture Clerk,male
5700,529f3080-d99a-0133-1b7b-0a81e8b09a82,PT,Data Capture Clerk,male
5701,0349c9d0-d9a1-0133-a38c-0a81e8b09a82,PT,Data Capture Clerk,Male

In [169]:
#how to drop na
dropped_table = data_plus_api.fillna(0)

In [170]:
dropped_table

,uuid,country_code,suggestion,gender
0,54f0f1c0-dda1-0133-a559-0a81e8b09a82,AT,Automatic Data Processing Planner,male
1,cf24ed60-da3f-0133-0034-0a81e8b09a82,AT,Automatic Data Processing Planner,FeMale
2,9ffc7390-dba5-0133-259b-0a81e8b09a82,BE,Automatic Data Processing Planner,male
3,a6361230-da58-0133-cd5a-0a81e8b09a82,BE,Automatic Data Processing Planner,Male
4,1e2b4750-d987-0133-3c7c-0a81e8b09a82,BG,Automatic Data Processing Planner,female
...,...,...,...,...
5697,1cb1aac0-d94c-0133-8baa-0a81e8b09a82,IT,Data Capture Clerk,male
5698,c8c33390-da69-0133-063a-0a81e8b09a82,PL,Data Capture Clerk,male
5699,d27d24d0-d9b1-0133-03d4-0a81e8b09a82,PL,Data Capture Clerk,male
5700,529f3080-d99a-0133-1b7b-0a81e8b09a82,PT,Data Capture Clerk,male
5701,0349c9d0-d9a1-0133-a38c-0a81e8b09a82,PT,Data Capture Clerk,Male

In [171]:
dropped_table.loc[~(dropped_table==0).all(axis=1)]

,uuid,country_code,suggestion,gender
0,54f0f1c0-dda1-0133-a559-0a81e8b09a82,AT,Automatic Data Processing Planner,male
1,cf24ed60-da3f-0133-0034-0a81e8b09a82,AT,Automatic Data Processing Planner,FeMale
2,9ffc7390-dba5-0133-259b-0a81e8b09a82,BE,Automatic Data Processing Planner,male
3,a6361230-da58-0133-cd5a-0a81e8b09a82,BE,Automatic Data Processing Planner,Male
4,1e2b4750-d987-0133-3c7c-0a81e8b09a82,BG,Automatic Data Processing Planner,female
...,...,...,...,...
5697,1cb1aac0-d94c-0133-8baa-0a81e8b09a82,IT,Data Capture Clerk,male
5698,c8c33390-da69-0133-063a-0a81e8b09a82,PL,Data Capture Clerk,male
5699,d27d24d0-d9b1-0133-03d4-0a81e8b09a82,PL,Data Capture Clerk,male
5700,529f3080-d99a-0133-1b7b-0a81e8b09a82,PT,Data Capture Clerk,male
5701,0349c9d0-d9a1-0133-a38c-0a81e8b09a82,PT,Data Capture Clerk,Male